{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "ViTForImageClassification",
    "parent_library": "transformers.models.vit.modeling_vit"
  },
  "base_model_name_or_path": "/DATA/jupyter/personal/lora_age/nateraw/vit-age-classifier",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [
    "classifier"
  ],
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "value",
    "query"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}